<template>
  <div class="word-wraper">
    <div>
      <span class="word">{{word}}</span>
    </div>

    <div class="btn">
      <van-button
        type="primary"
        style="margin-right:30px;"
        size="normal"
        @click="nextWord(true)"
      >认&nbsp;&nbsp;&nbsp;&nbsp;识</van-button>
      <van-button type="danger" size="normal" @click="nextWord(false)">不认识</van-button>
    </div>
    <div>已认识 ： {{rightCount}}个字， 不认识： {{wrongCount}}个字</div>
    <div>当前认识率 ： {{rightRate}}</div>
    <div>当前进度 ： 第{{finishCount}}字 / 总{{words.length}}字</div>
    <div>
      <van-button type="warning" size="small" style="margin-right:20px;" @click="backWord()">返回前一个修改</van-button>
      <van-button type="warning" size="small" @click="showOption=!showOption" v-show="false">选项</van-button>
      <div v-show="showOption">
        <van-field v-model="skipNum" label="跳过前多少字" placeholder="请输入数字">
          <van-button slot="button" size="small" type="primary" @click="jump(skipNum)">跳过</van-button>
        </van-field>
        <van-button @click="save()">保存当前进度</van-button>
        <div>显示已完成数据</div>
        <div>显示错字集</div>
      </div>
    </div>

    <!-- {{doneWords}} -->
  </div>
</template>

<script>
// var arr = "乙一二地用同所现是为";
// var arr =
// "的到主三产新一地用同所现是为那成起如了以道活把么不子学太进力在小工事前等有就多面着电人时去民没开上全发日而五这可作家样心大下自方部只我要好后长实国十过都又社来生动于问水们会对之法外和也行分从政个出里经本很他年能种定高中得二还见月说你天看两业当度什回象打义物儿情口论些想公几七门加体做最先东老此九八常女著知相级题放四关气位入期头制命结给真因然西性己数向其话代队展理表将教战资点重内次果通合化与路完农明应由党反名无各利六白解机但今便建叫意者手原革提使间平军立或第百量总少山正比员走文线条耍改务科更别美吃流难斗万再书治深收系听马领保信已才组联住究变运界金统且形必议记管怎它安车任处近边取并受认非阶被海极志料报南育基图何官接思质则呢决华设指研热她干件帮劳术及区光目每夫争身强市场眼声济品快带交北共直千亲布求计许导至石世特造花根达步器林王拿示拉办际校服积众群举该节亚省观即未精复风算死席树厂据调专约传越奸母局照备支增土类易钱婚程较空神技历火请单克讲兵团元权号告胜字爱毛京德选却持师转参整油清商须斯铁米广孩半具势委张装习织笑色连批青集院式压府早病板切觉找规友球望识往验谈河吗士紧族虽江除感食苦音站准般列引试村况呀失始包曾影低候哥洋黑倒确周跟怕段若晚破念似随格害推故养费断细温助满黄甚标英容防父速兴喜需红续言房片落修乐采游苏草田块哪消首项妇买离够价功银衣县坐双送城型写足赛巴职状台史证船止视古飞木罢希愿远注角鱼查投司屋急继显财欢阳弟固旧免效律答渐啦旅响妈严医谁错刻派轮良尺姐存啊孔初云归尽护击刀副令跑施款星男余坚富息按致读差像扬坏适创滑留叶帝协置武让轻负靠益纪敌朝待艺穿围吧率姑脚端阿供责夜换抗层皮营属配独划维雨密宽某企值监简迫判客既忙排洲闻底例称均久敢午考汽依演慢冷仍药短室血材恩货察背激春烟救芬饭毫守构另优借担虫乡获杂顶桥仅酒微波肯讨态付伤居乱凭圆画奇爷班印岁座减限诸钟预君策呼床鲜宣逐句停乎掉略卖赶互善零源卫承章环童素跳州纸您怪矿绝终封困戏充朋娘央吸述刚降案脸假汉语李诉普齐尼左占右瓶福含散灯植痛馆松杀兰粉唱险掌恶沙酸玩妹架斤针削肥移静肉罗丝超弹曲肆旁误菜景粮牛替野攻顾束模脑礼鼓课赞液输巷退惊犯罪烈冲藏播忽评练测谢挥编检境麦哈熟异范努露暗票翻睛径否缺夺促亦升登户培套茶钢危迎棉脱香哭搞堂夏鼠访突歌训灭祖射恐亮陈抓尚烧贵欧敬味尤嘴核宗盘凤临础补纳弱爸启伟孙甲街咱盛骨遇盖损蒙操潮兄胡耳混羊载辨倍控麻雄威弄稳狗昨销阵讯届晓雷伸闹丰附铜份鸟园顺庭末索奶磨宝泥镜店塞玉庄镇楼探额鸡永贫败舞吹侵毒岛航摇幕竟托毕寻横途概睡洗湖凡陆抵枝笔恼岸筑季洞煤介莫齿执录亿宁龙扩冬港卡招沿括缘秋妻健亩鲁阻召怀卷醒勇阴绩喝胞伯暴拜敞荣刺遍雪猪触篇忘抽恨旗休订炉杆械绿瓦巨逃亡惯氏征贸缩盾寸私疑顿偏唯津冰残版隔枪绍聪析剂聚杯佛谋透瞧窗姓墙穷欲挂庆谷粒献壁摆寨硬染沉狠楚追灵井抢剧税序晨乙灰牙厚喊袋薄践幸抱软皆奖奋苗握闭圈奴警氧虎刘域乃迅振粗浪瓜纷汗秩禁援杨尖映寒遣怒壮缓猫净尾堆俗圣彩博菌避彼遗蛋泪废怜督祝牌拆裁纯耐迷盐诗燃智勒洪距矛伙丽赵库桌裂愈雕剥惜股湿丹铺虚炮吨尊瞒驻钻择皇延徒拖乘竹奏彻拍康繁忍辛幼捉典勤览伐番汇妙殖渡涉劝牧岩贝辆箱糠珠浅贯柱网洁稿抬脉碎盟稻灾坦兔池旋鞋巧祥婆售川螺乌爆唤腿塔奔鬼厅垂妄耕贡释碗愁稍柴宜寄滚喷奥审擦仪授炼辈辞暖慌玻糊辟插趣悟奉涂斜债润甘捕叹叔湾侧壤乏丁宪震冒诚扎壳腐纵猛淡墨泰幅呆迹冠词鸣挑株骂沈夹予锦宫旱梦摄倾劲遭豆荷仙贺璃签帽页艰舍腰允爬丈秘虑浓扫迟伍泻秀乒累饮懂倘朗阀吉臣骗胆摸截森吴貌衡励符荒扇潜纺仿狂邻亏浮沟戴疾泛拔赏悲盆毁蜂珍锋纤妥购闪黎晶扶融邀灌胶拥撤辉肃疗绕殊揭邮饰隶仁唐泽梁恢竞偷赤渔哲骤耗伏宾孤纱贼卵仔默呈宋顽辩暂刑巩炭扑剩荡币申唉磁厘欺鼻狐仗袖割违污姻盗肚添棒泼漏挖耀颜患祸恰碰纹障贴刊胸朱牲栽柳嫂饿朵瑞龄颗弃炸郎冻鉴忠兼岂闯昼钢蒸蓄臂凝艇紫挤趁宿誉趋闷覆腾饲饱驾役乳塑喂弯昌阅匪徐凉袭斑燕租帖豪腹箭坡吐雅倡秤俱咬帐尘籍遵寿刷搬鹊丢叙汤拾旨芽舒窝跃肩碍陷摩脂偶缝欠蝇侮阁烦储详筒忧跌孟踏瞎饼眉拆绪峰阔稀猴拒牵绳搭畜尝键牢烂钉焦凶秒兽仰铃锅掘疮棋桑葡歇瘦蚕叛谅佩抛匹鸦翁隐剑昏蛇症辽妨仇羽扣苍橡悄享滋撞轨浙忆犹梅乞伴舌耻悬庙猜隆贷泉蜜铸骑赖雀汪卧拔敏惠晴蚊槽戎矮陪椅慰缸蓝巡返勉递逼码杜惨涨滴嫁剪埋轰俩屈劣敲锻屡琴吓罚闲郑伪吊扰丧译昆勿册篮漠岭狼膜棍筹柔挺桃贪弦悉宴驱肝捐鸭舅愤丙迈扯浸恭肤锁泡厉陶爹愚狡厌仆描愧循拳浆慈胀辱链脏骄冤偿旬隙谊甜穴掩旦粘眠惑嚷鹿匠赔宇竭吞腊摘飘墓抚嫩醉吵捧梯凯杰翼匀蓬芳迁携柄壶哀崇谨桂丑笼孝涌估糕催遮漆衰绵柜丛饥穗蚀逢慕昂筋乔疆栏怨薪巾侨岗秧浇浑傅辅塘赴柏纠拼躲疯恋悔棵宅渠铅慎贤跨咐舰赠畅询颈尸扭狮驶汁溜睁御鄙嘱弊漂咳溪驴贞砖梳萄蜡卜羞枯慧晒填竿踢矩躺酬虾厨捷殿茎肠胁绸绘桶吩腔爪蚁蔬坑疏钞霸锐煮傲盼龟牺洒廉辰舟惭串弓挡顷淋熊餐燥鹰膀郊劫臭婶滤峡欣戚雾狱旺轧恳猎绣暑葛熔堪鹅络姨烛滩杉霉漫佳刮魂誓挽妖炎赌撒裳仓堡颂锡逆罐晋酱僚董茫稼仍饶怠档疲拌驰裕躬诱砍贱抖姿宏泊绒膨粪剖颠侦渗狭驼歪蚂葬胃押棚勾垫朴蹲惰爽歼摊垦纽肿谱卸秆券盈盲枣脾袍疫址摔嫌滨惹恒痕佣摇翅披碧糟霞竖疼泳骆匆碑肺毅蝶浩溉芦侍搁缠堵搜催挨陵娃脆拘钓菊冶抹鞠轿脊狸贩叨概宙痰犬蛙棕丘诊堤陕皱斥酷叮艘框霜鸽凳踪扮掠谦缎拦辣伞羡叉寺杠挪榜赚肢泄畏惩茂凑撑夸咽渴犁亭盒蔽衬窃渣诞锤葱惧舱嘉喘娇炕缴捏膏刃坝筛屑焰茅唇捞兆颤赢孕幻懒垄掏薯梨苹驳坛厦冈傻沃锈逮蝴衔锯肌罩跪搅悠姜鞭遥毙俊拣铲窄怖烘叠逝屠裤尿掀屿愉哗抄晃攀帅拢洽夕莲扁沸哄枕钩窑哨挣帘涛翠沾胳崖蒜脖闸炒裹蕉滔伶傍胖塌僵橘斧谎绑捆撕浴踩禽晌袜袄蠢膊囊帜喉桨廊屯帆悦魔俯惕搏砌茧揉咸陡蹄乓榴锄荐裙肾艳酿蹈杏哑芝沫淘膝盏宰韵芒醋趟坟淹耽蔑皂钳萌喇匙萝悼嗓蛾倚劈庸垒灿梢粱挠朽俭灶毯垮涝鸣邪倦盯拐躁蛮烛馅扛忌俘絮桐骡坊瓣吼滥萍烤禾逗碌辫煌笨揪柿尔圾熄嗽辜趴昵筐锣澡厕榆侯膛眨榨殃镰兜猾樱雁茄删轴绞丸椒撇捡伊笛蛛炊聋剃谓旷贿娱暮咏乾嚼歉谜岔蜓哩扒腥栗槐疤萨乖拴啄痒蜻措秃钥寇虹挎溶垃筝稠捎箩爵糖崭讽勺锹犀诵晕笋睬菠邦甩烫馒葵饺俄窜眯侄栋叼埃粥蜘魄蹦芹彪斩虏宵绢姥柬僻雹煎搂馋琳频嗡曼铝凸钙砂袁莱蝙韩褐迂磷艾锥氨哼硫秦譬弧抑辐伦滞氯仲契杭廷娶拟瓷贮勘赫媳寂敦甫淀综哎儒凌昭衷函姆隅蟹卓蒂宦雇勃舶梧徽呵贾戈祈谬俺诺澳吏缚磅菩碳颇吁凛魏涕洛胎啥怔钠癌泵碱翔铣霍勋署枚渤履谴敷焊卢赐硅芯刨菲氢阐匈氮兢咧奈邓郭蒋钦姊辑穆卑帕坯鹏丐衍崩锌晰拱曹熙棘冯捣纬棱栈觅寡奠椿巢彭粤斋祭颁掷蜗涡涤弥哟歧稟卿婿挫媒凹逸衙浦怯讼淮凿靖玛吟猿拓潘腺谐拧吱醇蝗舆萧婴账裸鸿罕刹叭酵咨瞪逻溃吻暇籽绅辖嘿篷晤珊苇枢孵疟诡姚藤诬馏玫肖捂吕趾坎栓钾豫瘤幽雌颖粹聘驮缔岳玄蒲屏郁赋庞桩硝氛湘锭胚屁泣鼎迄咕忿沪诈甸蛉杉骚颊簇兑嵌淑昧惶缆饵镀坠潭遂墩稚雏栖昔虐瞬鹤枉焕礁嗅蔗凄稽糙梗鲸噪痴咒蝉畔鞍韧椭瑰僧梭尉篡逊沥邢懈撮肪豺喧嚣讥恍寓檐彰闺乍喻啼溢庇螟厢耿殷扳泌嘲豁仑憾逛砸镶澄鹉耸蝶搀葫囚眷峻沼灼汛矢椎恕踱茬筷栅荆焚鳄萎苟蔓汰玲棺鳞铭聊缅拙蕴溅伺囱娜琼窖歹寝翘朦谭夷篱捶揩羔磕瞻闽秉椰酌剿蕾汹箍碘圃耙苔媚氓钧黍汞魁隧磺咖蟆靴渊畦壕蓉呕鲤锰硕廓寞巍藻钝妆蹬熬畸蚜熏芭祷蛹擅洼翰蚌佑赎柑枫楞埝骇阎钮煞宛腕躯橱畴褂矫揖鳍膳彬懊菱堕淫驯缕烹啡薛毡遮屉杖薄聂竣窟砚赦捍哺舵瑟楔睦蔫亥眶隘腻";
var arr =
  "乙一二十丁厂七卜人入八九几儿了力乃刀又三于干亏士工土才寸下大丈与万上小口巾山千乞川亿个勺久凡及夕丸么广亡门义之尸弓己已子卫也女飞刃习叉马乡丰王井开夫天无元专云扎艺木五支厅不太犬区历尤友匹车巨牙屯比互切瓦止少日中冈贝内水见午牛手毛气升长仁什片仆化仇币仍仅斤爪反介父从今凶分乏公仓月氏勿欠风丹匀乌凤勾文六方火为斗忆订计户认心尺引丑巴孔队办以允予劝双书幻玉刊示末未击打巧正扑扒功扔去甘世古节本术可丙左厉右石布龙平灭轧东卡北占业旧帅归且旦目叶甲申叮电号田由史只央兄叼叫另叨叹四生失禾丘付仗代仙们仪白仔他斥瓜乎丛令用甩印乐句匆册犯外处冬鸟务包饥主市立闪兰半汁汇头汉宁穴它讨写让礼训必议讯记永司尼民出辽奶奴加召皮边发孕圣对台矛纠母幼丝式刑动扛寺吉扣考托老执巩圾扩扫地扬场耳共芒亚芝朽朴机权过臣再协西压厌在有百存而页匠夸夺灰达列死成夹轨邪划迈毕至此贞师尘尖劣光当早吐吓虫曲团同吊吃因吸吗屿帆岁回岂刚则肉网年朱先丢舌竹迁乔伟传乒乓休伍伏优伐延件任伤价份华仰仿伙伪自血向似后行舟全会杀合兆企众爷伞创肌朵杂危旬旨负各名多争色壮冲冰庄庆亦刘齐交次衣产决充妄闭问闯羊并关米灯州汗污江池汤忙兴宇守宅字安讲军许论农讽设访寻那迅尽导异孙阵阳收阶阴防奸如妇好她妈戏羽观欢买红纤级约纪驰巡寿弄麦形进戒吞远违运扶抚坛技坏扰拒找批扯址走抄坝贡攻赤折抓扮抢孝均抛投坟抗坑坊抖护壳志扭块声把报却劫芽花芹芬苍芳严芦劳克苏杆杠杜材村杏极李杨求更束豆两丽医辰励否还歼来连步坚旱盯呈时吴助县里呆园旷围呀吨足邮男困吵串员听吩吹呜吧吼别岗帐财针钉告我乱利秃秀私每兵估体何但伸作伯伶佣低你住位伴身皂佛近彻役返余希坐谷妥含邻岔肝肚肠龟免狂犹角删条卵岛迎饭饮系言冻状亩况床库疗应冷这序辛弃冶忘闲间闷判灶灿弟汪沙汽沃泛沟没沈沉怀忧快完宋宏牢究穷灾良证启评补初社识诉诊词译君灵即层尿尾迟局改张忌际陆阿陈阻附妙妖妨努忍劲鸡驱纯纱纳纲驳纵纷纸纹纺驴纽奉玩环武青责现表规抹拢拔拣担坦押抽拐拖拍者顶拆拥抵拘势抱垃拉拦拌幸招坡披拨择抬其取苦若茂苹苗英范直茄茎茅林枝杯柜析板松枪构杰述枕丧或画卧事刺枣雨卖矿码厕奔奇奋态欧垄妻轰顷转斩轮软到非叔肯齿些虎虏肾贤尚旺具果味昆国昌畅明易昂典固忠咐呼鸣咏呢岸岩帖罗帜岭凯败贩购图钓制知垂牧物乖刮秆和季委佳侍供使例版侄侦侧凭侨佩货依的迫质欣征往爬彼径所舍金命斧爸采受乳贪念贫肤肺肢肿胀朋股肥服胁周昏鱼兔狐忽狗备饰饱饲变京享店夜庙府底剂郊废净盲放刻育闸闹郑券卷单炒炊炕炎炉沫浅法泄河沾泪油泊沿泡注泻泳泥沸波泼泽治怖性怕怜怪学宝宗定宜审宙官空帘实试郎诗肩房诚衬衫视话诞询该详建肃录隶居届刷屈弦承孟孤陕降限妹姑姐姓始驾参艰线练组细驶织终驻驼绍经贯奏春帮珍玻毒型挂封持项垮挎城挠政赴赵挡挺括拴拾挑指垫挣挤拼挖按挥挪某甚革荐巷带草茧茶荒茫荡荣故胡南药标枯柄栋相查柏柳柱柿栏树要咸威歪研砖厘厚砌砍面耐耍牵残殃轻鸦皆背战点临览竖省削尝是盼眨哄显哑冒映星昨畏趴胃贵界虹虾蚁思蚂虽品咽骂哗咱响哈咬咳哪炭峡罚贱贴骨钞钟钢钥钩卸缸拜看矩怎牲选适秒香种秋科重复竿段便俩贷顺修保促侮俭俗俘信皇泉鬼侵追俊盾待律很须叙逃食盆胆胜胞胖脉勉狭狮独狡狱狠贸怨急饶蚀饺饼弯将奖哀亭亮度迹庭疮疯疫疤姿亲音帝施闻阀阁差养美姜叛送类迷前首逆总炼炸炮烂剃洁洪洒浇浊洞测洗活派洽染济洋洲浑浓津恒恢恰恼恨举觉宣室宫宪突穿窃客冠语扁袄祖神祝误诱说诵垦退既屋昼费陡眉孩除险院娃姥姨姻娇怒架贺盈勇怠柔垒绑绒结绕骄绘给络骆绝绞统耕耗艳泰珠班素蚕顽盏匪捞栽捕振载赶起盐捎捏埋捉捆捐损都哲逝换挽热恐壶挨耻耽恭莲莫荷获晋恶真框桂档桐株桥桃格校核样根索哥速逗栗配翅辱唇夏础破原套逐烈殊顾轿较顿毙致柴桌虑监紧党晒眠晓鸭晃晌晕蚊哨哭恩唤啊唉罢峰圆贼贿钱钳钻铁铃铅缺氧特牺造乘敌秤租积秧秩称秘透笔笑笋债借值倚倾倒倘俱倡候俯倍倦健臭射躬息徒徐舰舱般航途拿爹爱颂翁脆脂胸胳脏胶脑狸狼逢留皱饿恋桨浆衰高席准座脊症病疾疼疲效离唐资凉站剖竞部旁旅畜阅羞瓶拳粉料益兼烤烘烦烧烛烟递涛浙涝酒涉消浩海涂浴浮流润浪浸涨烫涌悟悄悔悦害宽家宵宴宾窄容宰案请朗诸读扇袜袖袍被祥课谁调冤谅谈谊剥恳展剧屑弱陵陶陷陪娱娘通能难预桑绢绣验继球理捧堵描域掩捷排掉堆推掀授教掏掠培接控探据掘职基著勒黄萌萝菌菜萄菊萍菠营械梦梢梅检梳梯桶救副票戚爽聋袭盛雪辅辆虚雀堂常匙晨睁眯眼悬野啦晚啄距跃略蛇累唱患唯崖崭崇圈铜铲银甜梨犁移笨笼笛符第敏做袋悠偿偶偷您售停偏假得衔盘船斜盒鸽悉欲彩领脚脖脸脱象够猜猪猎猫猛馅馆凑减毫麻痒痕廊康庸鹿盗章竟商族旋望率着盖粘粗粒断剪兽清添淋淹渠渐混渔淘液淡深婆梁渗情惜惭悼惧惕惊惨惯寇寄宿窑密谋谎祸谜逮敢屠弹随蛋隆隐婚婶颈绩绪续骑绳维绵绸绿琴斑替款堪搭塔越趁趋超提堤博揭喜插揪搜煮援裁搁搂搅握揉斯期欺联散惹葬葛董葡敬葱落朝辜葵棒棋植森椅椒棵棍棉棚棕惠惑逼厨厦硬确雁殖裂雄暂雅辈悲紫辉敞赏掌晴暑最量喷晶喇遇喊景践跌跑遗蛙蛛蜓喝喂喘喉幅帽赌赔黑铸铺链销锁锄锅锈锋锐短智毯鹅剩稍程稀税筐等筑策筛筒答筋筝傲傅牌堡集焦傍储奥街惩御循艇舒番释禽腊脾腔鲁猾猴然馋装蛮就痛童阔善羡普粪尊道曾焰港湖渣湿温渴滑湾渡游滋溉愤慌惰愧愉慨割寒富窜窝窗遍裕裤裙谢谣谦属屡强粥疏隔隙絮嫂登缎缓编骗缘瑞魂肆摄摸填搏塌鼓摆携搬摇搞塘摊蒜勤鹊蓝墓幕蓬蓄蒙蒸献禁楚想槐榆楼概赖酬感碍碑碎碰碗碌雷零雾雹输督龄鉴睛睡睬鄙愚暖盟歇暗照跨跳跪路跟遣蛾蜂嗓置罪罩错锡锣锤锦键锯矮辞稠愁筹签简毁舅鼠催傻像躲微愈遥腰腥腹腾腿触解酱痰廉新韵意粮数煎塑慈煤煌满漠源滤滥滔溪溜滚滨粱滩慎誉塞谨福群殿辟障嫌嫁叠缝缠静碧璃墙撇嘉摧截誓境摘摔聚蔽慕暮蔑模榴榜榨歌遭酷酿酸磁愿需弊裳颗嗽蜻蜡蝇蜘赚锹锻舞稳算箩管僚鼻魄貌膜膊膀鲜疑馒裹敲豪膏遮腐瘦辣竭端旗精歉熄熔漆漂漫滴演漏慢寨赛察蜜谱嫩翠熊凳骡缩慧撕撒趣趟撑播撞撤增聪鞋蕉蔬横槽樱橡飘醋醉震霉瞒题暴瞎影踢踏踩踪蝶蝴嘱墨镇靠稻黎稿稼箱箭篇僵躺僻德艘膝膛熟摩颜毅糊遵潜潮懂额慰劈操燕薯薪薄颠橘整融醒餐嘴蹄器赠默镜赞篮邀衡膨雕磨凝辨辩糖糕燃澡激懒壁避缴戴擦鞠藏霜霞瞧蹈螺穗繁辫赢糟糠燥臂翼骤鞭覆蹦镰翻鹰警攀蹲颤瓣爆疆壤耀躁嚼嚷籍魔灌蠢霸露囊罐隘腻";

export default {
  data() {
    return {
      word: "",
      words: ["人", "天", "地"],
      doneWords: [],
      skipNum: 0,
      showOption: false
    };
  },
  mounted() {
    window.addEventListener("beforeunload", e => this.beforeunloadHandler(e));
    if (localStorage.getItem("doneWords") != null)
      this.doneWords = JSON.parse(localStorage.getItem("doneWords"));
    if (localStorage.getItem("skipNum") != null)
      this.skipNum = localStorage.getItem("skipNum") - 0;

    this.words = arr.split("");
    this.word = this.words[this.doneWords.length];
    // window.onbeforeunload = function() {
    //   this.beforeunloadHandler(e);
    // };
  },
  destroyed() {
    window.removeEventListener("beforeunload", e =>
      this.beforeunloadHandler(e)
    );
  },
  computed: {
    rightRate() {
      var fixedF = (
        (this.rightCount / (this.rightCount + this.wrongCount)) *
        100
      ).toFixed(1);
      return this.rightCount + this.wrongCount === 0 ? 0 : fixedF + "%";
    },
    rightCount() {
      return this.doneWords.filter(w => w.right).length;
    },
    wrongCount() {
      return this.doneWords.filter(w => !w.right).length;
    },
    finishCount() {
      return this.doneWords.length;
    }
  },
  methods: {
    beforeunloadHandler(e) {
      this.save();
    },
    nextWord(flag) {
      if (this.doneWords.length === this.words.length) return;
      var obj = {};
      if (flag === true) {
        obj.right = true;
      } else {
        obj.right = false;
      }
      obj.word = this.word;
      this.doneWords.push(obj);
      if (this.doneWords.length === this.words.length) return;
      this.word = this.words[this.finishCount];
      console.log(this.doneWords);
    },
    backWord() {
      if (this.doneWords.length - 1 >= 0) {
        this.word = this.doneWords[this.doneWords.length - 1].word;
        this.doneWords.pop();
      }
    },
    jump(num) {
      this.words = arr.split("").slice(num);
      this.word = this.words[0];
      this.doneWords = [];
    },
    save() {
      localStorage.setItem("doneWords", JSON.stringify(this.doneWords));
      localStorage.setItem("skipNum", this.skipNum + "");
    }
  }
};
</script>

<style>
.word-wraper {
  margin-top: 20px;
}
.word {
  font-size: 290px;
  border: 4px solid black;
  padding: 20px;
}

.btn {
  margin-top: 30px;
}
button.van-button--normal {
  font-size: 30px;
  padding: 10px 20px;
  line-height: 30px;
  height: 50px;
  margin-bottom: 10px;
}
</style>